denote/20230101T175751--2022__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2022</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">2022</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc695f3e">技術的</a></li>
<li><a href="#org050b445">時系列で振り返る</a>
<ul>
<li><a href="#org3043c6a">退職</a></li>
<li><a href="#org25a6a36">徒歩で山手線一周</a></li>
<li><a href="#org7b1f8df">引っ越し</a></li>
<li><a href="#org9e80746">転職</a></li>
</ul>
</li>
<li><a href="#org850f3ae">変わったこと</a>
<ul>
<li><a href="#org03d279b">飲食店に行くように</a></li>
<li><a href="#org54e5c86">よくぶらつくように</a></li>
<li><a href="#org155bef1">快速線を理解した</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
2022年は社会人2年目だった。
8月の退職、10月の引っ越し、11月の入社と、後半の印象が強い。
</p>

<div id="outline-container-orgc695f3e" class="outline-2">
<h2 id="orgc695f3e"><a href="#orgc695f3e">技術的</a></h2>
<div class="outline-text-2" id="text-orgc695f3e">
<p>
1年で新しく学んだこと。
</p>

<ul class="org-ul">
<li><a href="../20210805005543-docker.html#ID-1658782a-d331-464b-9fd7-1f8233b8b7f8">Docker</a> を使えるようになった。完全にLinuxで開発するようになった。開発環境の整備から、コンテナの本番運用など</li>
<li><a href="../20220427215330-github_actions.html#ID-2d35ac9e-554a-4142-bba7-3c614cbfe4c4">GitHub Actions</a> に詳しくなった。自作アクションを作ってみたりもした</li>
<li><a href="../20210901101339-rust.html#ID-ddc21510-6693-4c1e-9070-db0dd2a8160b">Rust</a> 言語を学んでみた。ゲームを途中まで作ってみた</li>
<li><a href="../20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a> 言語を学んで業務で使う。そこまで熟達してない</li>
<li><a href="../20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>の設定ファイルの文芸化</li>
</ul>
</div>
</div>

<div id="outline-container-org050b445" class="outline-2">
<h2 id="org050b445"><a href="#org050b445">時系列で振り返る</a></h2>
<div class="outline-text-2" id="text-org050b445">
</div>
<div id="outline-container-org3043c6a" class="outline-3">
<h3 id="org3043c6a"><a href="#org3043c6a">退職</a></h3>
<div class="outline-text-3" id="text-org3043c6a">
<p>
約2年働いた会社を退職した。
</p>
</div>
</div>
<div id="outline-container-org25a6a36" class="outline-3">
<h3 id="org25a6a36"><a href="#org25a6a36">徒歩で山手線一周</a></h3>
<div class="outline-text-3" id="text-org25a6a36">
<p>
7時ぐらいに品川駅を出発して、夜9時ごろにゴールする過酷な一周をした。街の距離感、それぞれの街に対する印象が生まれた。
</p>
</div>
</div>
<div id="outline-container-org7b1f8df" class="outline-3">
<h3 id="org7b1f8df"><a href="#org7b1f8df">引っ越し</a></h3>
<div class="outline-text-3" id="text-org7b1f8df">
<p>
浅草橋から高円寺に引っ越した。高円寺だったのはみうらじゅんや村上龍も住んだというのを知っていて、なんだかイケてそうな雰囲気だったため。
</p>
</div>
</div>
<div id="outline-container-org9e80746" class="outline-3">
<h3 id="org9e80746"><a href="#org9e80746">転職</a></h3>
<div class="outline-text-3" id="text-org9e80746">
<p>
ギークが集まっている会社に転職。
</p>
</div>
</div>
</div>
<div id="outline-container-org850f3ae" class="outline-2">
<h2 id="org850f3ae"><a href="#org850f3ae">変わったこと</a></h2>
<div class="outline-text-2" id="text-org850f3ae">
</div>
<div id="outline-container-org03d279b" class="outline-3">
<h3 id="org03d279b"><a href="#org03d279b">飲食店に行くように</a></h3>
<div class="outline-text-3" id="text-org03d279b">
<p>
出社が復活したとき、ランチをいろいろ連れて行ってもらって楽しかった。
</p>
</div>
</div>
<div id="outline-container-org54e5c86" class="outline-3">
<h3 id="org54e5c86"><a href="#org54e5c86">よくぶらつくように</a></h3>
<div class="outline-text-3" id="text-org54e5c86">
<p>
原宿の町並みや雰囲気が面白かったので、ぶらぶらするのが好きになった。金も余裕ができたので、映画を見たり外食することのハードルが低くなった。
</p>
</div>
</div>
<div id="outline-container-org155bef1" class="outline-3">
<h3 id="org155bef1"><a href="#org155bef1">快速線を理解した</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
